stm32duino/Arduino_Core_STM32/libraries/SrcWrapper/src/stm32/uart.c
#if defined(LPUART1_BASE) || defined(LPUART2_BASE)
  /*
   * Note that LPUART clock source must be in the range
   * [3 x baud rate, 4096 x baud rate]
   * check Reference Manual
   */
  if ((obj->uart == LPUART1)
#if defined(LPUART2_BASE)
      || (obj->uart == LPUART2)
#endif
#if defined(LPUART3_BASE)
      || (obj->uart == LPUART3)
#endif
     ) {
    if (baudrate <= 9600) {
#if defined(USART_CR3_UCESM)
      HAL_UARTEx_EnableClockStopMode(huart);
#endif
      HAL_UARTEx_EnableStopMode(huart);
    } else {
#if defined(USART_CR3_UCESM)
      HAL_UARTEx_DisableClockStopMode(huart);
#endif
      HAL_UARTEx_DisableStopMode(huart);
    }
    /* Trying default LPUART clock source */
    if ((uart_rx == NP) && (uart_rx_swap == NP)) {
      if (HAL_HalfDuplex_Init(huart) == HAL_OK) {
        return;
      }
    } else if (HAL_UART_Init(huart) == HAL_OK) {
      return;
    }
    /* Trying to change LPUART clock source */
    /* If baudrate is lower than or equal to 9600 try to change to LSE */
    if (baudrate <= 9600) {
      /* Enable the clock if not already set by user */
      enableClock(LSE_CLOCK);
      if (LL_RCC_LSE_IsReady()) {
        if (obj->uart == LPUART1) {
          __HAL_RCC_LPUART1_CONFIG(RCC_LPUART1CLKSOURCE_LSE);
        }
#if defined(LPUART2_BASE)
        if (obj->uart == LPUART2) {
          __HAL_RCC_LPUART2_CONFIG(RCC_LPUART2CLKSOURCE_LSE);
        }
#endif
#if defined(LPUART3_BASE)
        if (obj->uart == LPUART3) {
          __HAL_RCC_LPUART3_CONFIG(RCC_LPUART3CLKSOURCE_LSE);
        }
#endif
        if ((uart_rx == NP) && (uart_rx_swap == NP)) {
          if (HAL_HalfDuplex_Init(huart) == HAL_OK) {
            return;
          }
        } else if (HAL_UART_Init(huart) == HAL_OK) {
          return;
        }
      }
    }
    if (LL_RCC_HSI_IsReady()) {
      if (obj->uart == LPUART1) {
        __HAL_RCC_LPUART1_CONFIG(RCC_LPUART1CLKSOURCE_HSI);
      }
#if defined(LPUART2_BASE)
      if (obj->uart == LPUART2) {
        __HAL_RCC_LPUART2_CONFIG(RCC_LPUART2CLKSOURCE_HSI);
      }
#endif
#if defined(LPUART3_BASE)
      if (obj->uart == LPUART3) {
        __HAL_RCC_LPUART3_CONFIG(RCC_LPUART3CLKSOURCE_HSI);
      }
#endif
      if ((uart_rx == NP) && (uart_rx_swap == NP)) {
        if (HAL_HalfDuplex_Init(huart) == HAL_OK) {
          return;
        }
      } else if (HAL_UART_Init(huart) == HAL_OK) {
        return;
      }
    }
    if (obj->uart == LPUART1) {
#if defined(RCC_LPUART1CLKSOURCE_CSI)
      __HAL_RCC_LPUART1_CONFIG(RCC_LPUART1CLKSOURCE_CSI);
#elif defined(RCC_LPUART1CLKSOURCE_PCLK1)
      __HAL_RCC_LPUART1_CONFIG(RCC_LPUART1CLKSOURCE_PCLK1);
#elif defined(RCC_LPUART1CLKSOURCE_PCLK3)
      __HAL_RCC_LPUART1_CONFIG(RCC_LPUART1CLKSOURCE_PCLK3);
#endif
    }
#if defined(LPUART2_BASE)
    if (obj->uart == LPUART2) {
      __HAL_RCC_LPUART2_CONFIG(RCC_LPUART2CLKSOURCE_PCLK1);
    }
#endif
#if defined(LPUART3_BASE)
    if (obj->uart == LPUART3) {
      __HAL_RCC_LPUART3_CONFIG(RCC_LPUART3CLKSOURCE_PCLK1);
    }
#endif
    if ((uart_rx == NP) && (uart_rx_swap == NP)) {
      if (HAL_HalfDuplex_Init(huart) == HAL_OK) {
        return;
      }
    } else if (HAL_UART_Init(huart) == HAL_OK) {
      return;
    }
#if defined(RCC_LPUART1CLKSOURCE_SYSCLK)
    if (obj->uart == LPUART1) {
      __HAL_RCC_LPUART1_CONFIG(RCC_LPUART1CLKSOURCE_SYSCLK);
    }
#endif
#if defined(LPUART2_BASE)
    if (obj->uart == LPUART2) {
      __HAL_RCC_LPUART2_CONFIG(RCC_LPUART2CLKSOURCE_SYSCLK);
    }
#endif
#if defined(LPUART3_BASE)
    if (obj->uart == LPUART3) {
      __HAL_RCC_LPUART3_CONFIG(RCC_LPUART3CLKSOURCE_SYSCLK);
    }
#endif
  }
#endif

  if ((uart_rx == NP) && (uart_rx_swap == NP)) {
    if (HAL_HalfDuplex_Init(huart) != HAL_OK) {
      return;
    }
  } else if (HAL_UART_Init(huart) != HAL_OK) {
    return;
  }
}

/**
  * @brief  Function called to deinitialize the uart interface
  * @param  obj : pointer to serial_t structure
  * @retval None
  */
void uart_deinit(serial_t *obj)
{
  /* Reset UART and disable clock */
  switch (obj->index) {
#if defined(USART1_BASE)
    case UART1_INDEX:
      __HAL_RCC_USART1_FORCE_RESET();
      __HAL_RCC_USART1_RELEASE_RESET();
      __HAL_RCC_USART1_CLK_DISABLE();
      break;
#endif
#if defined(USART2_BASE)
    case UART2_INDEX:
      __HAL_RCC_USART2_FORCE_RESET();
      __HAL_RCC_USART2_RELEASE_RESET();
      __HAL_RCC_USART2_CLK_DISABLE();
      break;
#endif
#if defined(USART3_BASE)
    case UART3_INDEX:
      __HAL_RCC_USART3_FORCE_RESET();
      __HAL_RCC_USART3_RELEASE_RESET();
      __HAL_RCC_USART3_CLK_DISABLE();
      break;
#endif
#if defined(UART4_BASE)
    case UART4_INDEX:
      __HAL_RCC_UART4_FORCE_RESET();
      __HAL_RCC_UART4_RELEASE_RESET();
      __HAL_RCC_UART4_CLK_DISABLE();
      break;
#elif defined(USART4_BASE)
    case UART4_INDEX:
      __HAL_RCC_USART4_FORCE_RESET();
      __HAL_RCC_USART4_RELEASE_RESET();
      __HAL_RCC_USART4_CLK_DISABLE();
      break;
#endif
#if defined(UART5_BASE)
    case UART5_INDEX:
      __HAL_RCC_UART5_FORCE_RESET();
      __HAL_RCC_UART5_RELEASE_RESET();
      __HAL_RCC_UART5_CLK_DISABLE();
      break;
#elif defined(USART5_BASE)
    case UART5_INDEX:
      __HAL_RCC_USART5_FORCE_RESET();
      __HAL_RCC_USART5_RELEASE_RESET();
      __HAL_RCC_USART5_CLK_DISABLE();
      break;
#endif
#if defined(USART6_BASE)
    case UART6_INDEX:
      __HAL_RCC_USART6_FORCE_RESET();
      __HAL_RCC_USART6_RELEASE_RESET();
      __HAL_RCC_USART6_CLK_DISABLE();
      break;
#endif
#if defined(LPUART1_BASE)
    case LPUART1_INDEX:
      __HAL_RCC_LPUART1_FORCE_RESET();
      __HAL_RCC_LPUART1_RELEASE_RESET();
      __HAL_RCC_LPUART1_CLK_DISABLE();
      break;
#endif
#if defined(LPUART2_BASE)
    case LPUART2_INDEX:
      __HAL_RCC_LPUART2_FORCE_RESET();
      __HAL_RCC_LPUART2_RELEASE_RESET();
      __HAL_RCC_LPUART2_CLK_DISABLE();
      break;
#endif
#if defined(LPUART3_BASE)
    case LPUART3_INDEX:
      __HAL_RCC_LPUART3_FORCE_RESET();
      __HAL_RCC_LPUART3_RELEASE_RESET();
      __HAL_RCC_LPUART3_CLK_DISABLE();
      break;
#endif
#if defined(UART7_BASE)
    case UART7_INDEX:
      __HAL_RCC_UART7_FORCE_RESET();
      __HAL_RCC_UART7_RELEASE_RESET();
      __HAL_RCC_UART7_CLK_DISABLE();
      break;
#elif defined(USART7_BASE)
    case UART7_INDEX:
      __HAL_RCC_USART7_FORCE_RESET();
      __HAL_RCC_USART7_RELEASE_RESET();
      __HAL_RCC_USART7_CLK_DISABLE();
      break;
#endif
#if defined(UART8_BASE)
    case UART8_INDEX:
      __HAL_RCC_UART8_FORCE_RESET();
      __HAL_RCC_UART8_RELEASE_RESET();
      __HAL_RCC_UART8_CLK_DISABLE();
      break;
#elif defined(USART8_BASE)
    case UART8_INDEX:
      __HAL_RCC_USART8_FORCE_RESET();
      __HAL_RCC_USART8_RELEASE_RESET();
      __HAL_RCC_USART8_CLK_DISABLE();
      break;
#endif
#if defined(UART9_BASE)
    case UART9_INDEX:
      __HAL_RCC_UART9_FORCE_RESET();
      __HAL_RCC_UART9_RELEASE_RESET();
      __HAL_RCC_UART9_CLK_DISABLE();
      break;
#endif
#if defined(UART10_BASE)
    case UART10_INDEX:
      __HAL_RCC_UART10_FORCE_RESET();
      __HAL_RCC_UART10_RELEASE_RESET();
      __HAL_RCC_UART10_CLK_DISABLE();
      break;
#endif
#if defined(USART10_BASE)
    case UART10_INDEX:
      __HAL_RCC_USART10_FORCE_RESET();
      __HAL_RCC_USART10_RELEASE_RESET();
      __HAL_RCC_USART10_CLK_DISABLE();
      break;
#endif
#if defined(USART11_BASE)
    case UART11_INDEX:
      __HAL_RCC_USART11_FORCE_RESET();
      __HAL_RCC_USART11_RELEASE_RESET();
      __HAL_RCC_USART11_CLK_DISABLE();
      break;
#endif
#if defined(UART12_BASE)
    case UART12_INDEX:
      __HAL_RCC_UART12_FORCE_RESET();
      __HAL_RCC_UART12_RELEASE_RESET();
      __HAL_RCC_UART12_CLK_DISABLE();
      break;
#endif
  }

